{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 16, 32, 3], "border_mode": "valid", "bias": true, "trainable": true, "activation": "relu", "subsample": [1, 1], "nb_filter": 32, "name": "convolution2d_1", "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "trainable": true, "activation": "relu", "subsample": [1, 1], "nb_filter": 32, "name": "convolution2d_2", "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 1536], "bias": true, "trainable": true, "activation": "linear", "output_dim": 1, "name": "dense_1", "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}], "keras_version": "1.1.2"}